[
    {
        "slug": "/introduction",
        "title": "Introduction",
        "description": "Getting started with migrating from Redux Saga to Redux Toolkit",
        "content": "This section provides an overview of the migration process from Redux Saga to Redux Toolkit in the sails-vvl-device-details-app repo."
    },
    {
        "slug": "/introduction/base-knowledge",
        "title": "Base Knowledge",
        "description": "Fundamental concepts for migrating from Redux Saga to Redux Toolkit",
        "content": "Learn about the key differences between Redux Saga and Redux Toolkit, and why migrating can be beneficial for your project."
    },
    {
        "slug": "/introduction/migration-steps",
        "title": "Steps of Migration",
        "description": "A step-by-step guide for migrating from Redux Saga to Redux Toolkit",
        "content": "This section outlines the general steps involved in migrating your project from Redux Saga to Redux Toolkit."
    },
    {
        "slug": "/introduction/structure-overview",
        "title": "Structure Overview",
        "description": "Understanding the new structure after migration",
        "content": "Get an overview of how your project structure will change after migrating from Redux Saga to Redux Toolkit."
    },
    {
        "slug": "/hands-on-vvl",
        "title": "Hands on VVL",
        "description": "Practical implementation of the migration process",
        "content": "This section provides hands-on guidance for migrating the sails-vvl-device-details-app from Redux Saga to Redux Toolkit."
    },
    {
        "slug": "/hands-on-vvl/api-migration",
        "title": "API Migration",
        "description": "Migrating API calls from Redux Saga to Redux Toolkit",
        "content": "Learn how to migrate your API calls from Redux Saga to Redux Toolkit's createAsyncThunk."
    },
    {
        "slug": "/hands-on-vvl/saga-to-listeners",
        "title": "Saga to Listeners",
        "description": "Converting Redux Saga effects to Redux Toolkit listeners",
        "content": "This section guides you through the process of converting your Redux Saga effects to Redux Toolkit's listener middleware."
    },
    {
        "slug": "/hands-on-vvl/updating-selectors",
        "title": "Updating the Selectors",
        "description": "Adapting selectors for use with Redux Toolkit",
        "content": "Learn how to update your selectors to work with the new Redux Toolkit state structure."
    },
    {
        "slug": "/hands-on-vvl/components-separation",
        "title": "Components Separation",
        "description": "Refactoring components for better separation of concerns",
        "content": "This section covers how to separate your components for better maintainability after migrating to Redux Toolkit."
    },
    {
        "slug": "/hands-on-vvl/code-testing",
        "title": "Code Reviewing & Testing",
        "description": "Testing strategies for Redux Toolkit implementation",
        "content": "This section covers testing strategies for your newly migrated Redux Toolkit code, including both unit testing and integration testing approaches."
    }
]
